КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость/КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД</name>
    <comment>Уникальный идентификатор, выданный ГИС Минтранса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСВ</name>
    <comment>Должен быть уникальным в пределах Года и Организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСВ</name>
    <comment>Дава оформления документа.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <comment>Юр лицо, предоставляющее груз к перевозке, отправитель докуметна(Титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Юр. лицо, осуществляющее перевозку, получатель этого Документа(титула) в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <comment>Юр лицо - получатель груза (необязательно покупатель по договору)</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектроннаяСопроводительнаяВедомость/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда 
		
		ТипДокумента = ДанныеЗаполнения.ТипДокумента;
		
		ТекстФайла = ДанныеЗаполнения.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ДанныеЗаполнения + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВПеревозчика(ТипДокумента) Тогда 
			
			КС = КонтурЛогистика_КонструкторыXDTO;
			СодСВИнфПрв 	= XDTO.Документ.СодСВИнфПрв;
			
			НомерСВ 	= КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "НомерСВ");
			ДатаСВ_raw = КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "ДатаСВ");
			ДатаСВ     = КС.Конвертировать_ДатаТип_вДата(ДатаСВ_raw);
			
			Грузоотправитель 	= КС.Конвертировать_УчастникСВ_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "СвГО"), "ГО_");
			Перевозчик 			= КС.Конвертировать_УчастникСВ_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "СвПрв"), "Прв");
			Грузополучатель 	= КС.Конвертировать_УчастникСВ_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодСВИнфПрв, "СвГП"), "ГП_");
			
			Если Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВПеревозчика(ТипДокумента) Тогда
				
				ПеревозчикПодразделение 		= ДанныеЗаполнения.ОтправительПодразделение;
				
				Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул1 
					Или ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.СВ_Титул3 Тогда
					ГрузоотправительПодразделение 	= ДанныеЗаполнения.ПолучательПодразделение;
				Иначе // Т5,Т7,Т9
					ГрузополучательПодразделение 	= ДанныеЗаполнения.ПолучательПодразделение;
				КонецЕсли;
				
			ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВГрузоотправителя(ТипДокумента) Тогда
				
				ГрузоотправительПодразделение 	= ДанныеЗаполнения.ОтправительПодразделение;
				ПеревозчикПодразделение 		= ДанныеЗаполнения.ПолучательПодразделение;
				
			ИначеЕсли Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЭтоТитулСВГрузополучателя(ТипДокумента) Тогда
				
				ГрузополучательПодразделение 	= ДанныеЗаполнения.ОтправительПодразделение;
				ПеревозчикПодразделение 		= ДанныеЗаполнения.ПолучательПодразделение;
				
			КонецЕсли;
			
		Иначе
			 Сообщить("Обработка заполнения Документа СВ из " + ТипДокумента + " не поддерживается");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
